# if __name__ == '__main__':
    # 1.  4
    # 2.  (가) 클래스  (나) 객체
    # 3.  3,5
    # 4.  1)  '아이스크림을 레인보우 샤베트에서 바람과 함께 사라지다로 변경해주세요.'
    #         '아이스크림 맛을 바람과 함께 사라지다로 변경해드렸어요.'
    #     2)  'Korean'
    #         'English'
    #         'Im Groot!'
    #     3)  '현재 선수의 등번호는: 10'
    #         '현재 선수의 등번호는: 5'
    #     4)  'My name is Thanos and my weapon is infinity gauntlet'
    #     5) "Mineral: 72"
    #     6)  None, 'F', '72.0', 'F'
    # 5.  1)  (가)
    #             '이름 : John'
    #             '나이 : 22'
    #             '직위 : 연구원'
    #             '저는 연구원 John입니다. 나이는 22입니다.'
    #             '저는 학사입니다.'\
    #             '=================================================='
    #             '이름 : Tedd'
    #             '나이 : 40'
    #             '직위 : 소장'
    #             '저는 소장 Tedd입니다. 나이는 40입니다.'
    #             '저는 박사입니다.'
    #         (나)
    #             상속
    #     2)  (가)
    #             LG에서 만든 2019년형 32인치 TV
    #         (나)
    #             상속, method overriding
